{"status":"evergreen","statusIcon":"🌲","title":"The learning process","description":"A repeating cycle of receiving input, processing it to create output, evaluating that output, and evaluating results to improve future processing.","slug":"learning-process","publish":true,"lastmod":"2021-07-27T00:00:00.000Z","date":"2021-07-27T00:00:00.000Z","aliases":["The learning process"],"tags":["status/evergreen","topic/learning","taxonomy/idea"],"timeToRead":2,"internalLinks":["/notes/world-recursive"],"flashcards":[],"html":"<p>I’ve observed that the learning process has 4 generalized steps:</p>\n<ol><li>Inputs are received and processed.</li>\n<li>The input processing system runs to produce an output.</li>\n<li>The output is evaluated.</li>\n<li>Evaluation results are incorporated back into the input processing system.</li></ol>\n<h2 id=\"examples-of-the-learning-process\"><a href=\"#examples-of-the-learning-process\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Examples of the learning process</h2>\n<p>The learning process seems to be common in domains rich with knowledge workers. Tech being a prominent example, has two extremely popular implementations of the learning process:</p>\n<h2 id=\"agile-sprints\"><a href=\"#agile-sprints\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a><em>Agile sprint</em>s</h2>\n<ol><li>During sprint planning, feature requests and bugs are received as inputs. These inputs get processed into <em>User stories</em> which have valuable metadata like estimated completion time and priority. The team then decides which tasks will produce the best output at the end of the sprint.</li>\n<li>During the sprint, the team does the work outlined in the user stories they selected in sprint planning (this is the input being processed to produce an output).</li>\n<li>At the sprint review, delivered work is evaluated against the <em>Definition of done</em> from the committed user stories. </li>\n<li>At the sprint retrospectives, the team uses the insights of how they did during the current sprint to figure out ways of refining their process for the next sprint.</li></ol>\n<h2 id=\"feed-forward-back-propagation-neural-networks\"><a href=\"#feed-forward-back-propagation-neural-networks\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Feed-forward <em>Back-propagation</em> <em>Neural networks</em></h2>\n<ol><li>Inputs values are provided to the input neurons</li>\n<li>The inputs are fed forward through the neural network to produce values at each output node</li>\n<li>The output is scored.</li>\n<li>Results from scoring the output are sent back through the neural network so connection weights can be tweaked to produce better results using Back-propagation.</li></ol>\n<p>Related: <a href=\"/notes/world-recursive\">The world is recursive</a>.</p>","css":{"code":"","map":null},"head":"","href":"/notes/learning-process/","component":{}}