{"status":"budding","statusIcon":"🌿","title":"The strategy canvas","description":"An analytical tool that shows how much emphasis companies place on value areas in their industry.","slug":"strategy-canvas","publish":true,"lastmod":"2021-09-13","date":"2021-09-13","aliases":["Strategy canvas","The strategy canvas"],"tags":["status/budding","flashcards/business","course/BlueOceanStrategy"],"html":"<p>A strategy canvas is an analytical tool that highlights the <a href=\"/notes/competition-factors\">Factors of competition</a>within the canvassed market, as well as the emphasis companies place on them. </p>\n<p>Strategy canvases surface insight about which <a href=\"/notes/competition-factors\">Factors of competition</a> a company (or group of companies) are focused on. It does this by presenting a line chart with the axes set up so that <a href=\"/notes/competition-factors\">Factors of competition</a> (including price) are along the X axis and the emphasis a company places on those factors are along the Y axis.  </p>\n<p>Plotting a company on a strategy canvas creates a <strong><a href=\"/notes/value-curve\">value curve</a></strong>.  </p>\n<p>The strategy canvas is used to help identify Blue ocean opportunities.  </p>\n<p>When an innovative company is plotted on the strategy canvas for a sector, it’s likely that new <a href=\"/notes/competition-factors\">Factors of competition</a> will need to be added. These factors are new because the existing competitors have no emphasis on them. This signals an opportunity to create a <a href=\"/notes/blue-ocean\">Blue ocean</a>. It’s common for innovators to drop the emphasis on some established <a href=\"/notes/competition-factors\">Factors of competition</a> in their sector in favor of their unique new factors. Doing so makes it easier to escape the competition of a <a href=\"/notes/red-ocean\">Red ocean</a>.</p>","css":{"code":"","map":null},"head":"","href":"/notes/strategy-canvas","component":{},"internalLinks":["/notes/competition-factors","/notes/value-curve","/notes/blue-ocean","/notes/red-ocean"]}