{"status":"evergreen","statusIcon":"🌲","title":"Type-1 and Type-2 Decisions","description":"","slug":"type-1-2-decisions","publish":true,"lastmod":"2021-08-19","date":"2021-07-14","aliases":["Type-1 and Type-2 Decisions"],"tags":["flashcards/concepts","status/evergreen"],"html":"<h1 id=\"type-1-and-type-2-decisions\"><a href=\"#type-1-and-type-2-decisions\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Type-1 and Type-2 Decisions</h1>\n<p>Often when making decisions, people are burdened by the risks. The risks form some decisions are easier to mitigate than others. Depending on whether or not they are reversible, decisions can be classified as type-1 or type-2.</p>\n<p>Type-1 decisions are 1-way decisions. After proceeding forward with them, there is no going back. The risks are much harder to mitigate as a result of this. </p>\n<p>Some examples of type-1 decisions are:</p>\n<ul><li>Terminating a relationship - whether with an employee, spouse, business partner, or otherwise.</li>\n<li>Selling a business</li>\n<li>Initiating a lawsuit</li></ul>\n<p>People tend to view most decisions as type-1, looking at the risk of what could happen if it goes wrong. Fortunately, most decisions are <em>not</em> type-1, but are instead type-2 decisions.</p>\n<p>Type-2 decisions are decisions which can be changed or even reversed. While they may feel hard to come back from, the decisions can be modified or undone, often with a modest investment of time and effort. </p>\n<p>Some examples of type-2 decisions are:</p>\n<ul><li>Making a career change into a new discipline or industry</li>\n<li>Starting a side hustle</li>\n<li>Creating a new pricing or Business model for a product or service.</li></ul>\n<p>As goals, priorities, and scale increase, decisions are increasingly treated as type-1 decisions. Realizing that many of them are type-2 decisions may make it easier to make more ambitious moves. </p>\n<p>Is there a type-2 decision in your life that’s being treated as a type-1 decision? Consider whether it makes sense to take the risk, knowing that it is possible to change or reverse it if things don’t pan out. </p>","css":{"code":"","map":null},"head":"","href":"/notes/type-1-2-decisions","component":{},"internalLinks":[]}