{"status":"seedling","statusIcon":"🌱","title":"Value curve","description":"The line on a strategy canvas showing the emphasis a company places on each factor of competition in its industry.","slug":"value-curve","publish":true,"lastmod":"2021-09-16","date":"2021-09-16","aliases":["Value curve","value curve"],"tags":["status/seedling","flashcards/business/strategy","courses/BlueOceanStrategy"],"html":"<p>A value curve is the result of plotting a company on a Strategy canvas. </p>\n<h2 id=\"red-ocean-value-curves\"><a href=\"#red-ocean-value-curves\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Red ocean value curves</h2>\n<p>When a company and its competitors have similarly shaped or converging value curves, they are likely to be in a Red ocean.</p>\n<h2 id=\"blue-ocean-value-curves\"><a href=\"#blue-ocean-value-curves\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Blue ocean value curves</h2>\n<p>Two of the three <a href=\"/notes/traits-successful-blue-ocean-strategy\">common traits of successful blue ocean strategies</a> appear on a value curve. These make value curves an excellent way to identify <a href=\"/notes/blue-ocean\">Blue ocean</a> strategies. These traits are <strong>focus</strong> and <strong>divergence</strong>. Focus appears as a small number of <a href=\"/notes/competition-factors\">Factors of competition</a> with very high emphasis. <em>Divergence</em> appears as a value curve with a <em>shape</em> that <em>diverges</em> from the rest of the industry.</p>\n<p>When looking at a company’s value curve on a <a href=\"/notes/strategy-canvas\">Strategy canvas</a>, their <strong>focus</strong> (or lack thereof) is identified by a small number of <a href=\"/notes/competition-factors\">Factors of competition</a> which are heavily emphasized. Typically some other factors are <a href=\"/notes/four-actions-framework\">eliminated or reduced</a> compared to the rest of the industry. These attributes highlight the company’s <a href=\"/notes/value-innovation\">value innovation</a></p>\n<p>Analyzing a company’s value curve on a <a href=\"/notes/strategy-canvas\">Strategy canvas</a>, it’s possible to identify <strong>divergence</strong> by looking for a value curve with a unique shape that differs from others in the industry.</p>\n<h2 id=\"other-insights-from-value-curves\"><a href=\"#other-insights-from-value-curves\" aria-hidden=\"true\" tabindex=\"-1\"><span class=\"icon icon-link\"></span></a>Other insights from value curves</h2>\n<p>When a value curve shows high emphasis across a many <a href=\"/notes/competition-factors\">Factors of competition</a>, evaluate whether the company is <em>over-delivering</em> without benefit. Such expensive investments need to be justified, such as by greater profits, substantial market share, or establishing a moat to isolate against competition.</p>\n<p><em>Over-delivering</em> is when a company is investing in features or <a href=\"/notes/competition-factors\">Factors of competition</a> that provide limited incremental value for customers.</p>\n<p>When a company’s value curve zig-zags across the <a href=\"/notes/strategy-canvas\">Strategy canvas</a>, it may be a sign of an incoherent strategy. While each decision may be reasonable in isolation, it’s unlikely that there is a unifying strategy behind them.</p>","css":{"code":"","map":null},"head":"","href":"/notes/value-curve","component":{},"internalLinks":["/notes/traits-successful-blue-ocean-strategy","/notes/blue-ocean","/notes/competition-factors","/notes/strategy-canvas","/notes/four-actions-framework","/notes/value-innovation"]}